cqrs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-04-05 一 15:15 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CQRS的实现</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">CQRS的实现</h1>
<p>
<a href="./index.html">回到首页</a>
</p>

<div id="outline-container-orgce703a7" class="outline-2">
<h2 id="orgce703a7"><span class="section-number-2">1</span> 起因</h2>
<div class="outline-text-2" id="text-1">
<p>
许多情况下，在某个系统中读操作的次数是远大于写操作的，例如电商网站，对商品信息的读取次数远大于在网站上建立订单的次数，这时通常会将读操作与写操作分开处理，这么做的目的是
</p>
<ul class="org-ul">
<li>优化读操作，只要优化了读操作，整个系统的工作效率就会大幅提升</li>
<li>写操作通常很慢，我们不希望它影响频率很高的读操作，所以将其单独处理</li>
</ul>
</div>
</div>

<div id="outline-container-orgd29933b" class="outline-2">
<h2 id="orgd29933b"><span class="section-number-2">2</span> 结构</h2>
<div class="outline-text-2" id="text-2">
<pre class="example">

	    |------------|     /---------\  
	    | Master     |----| Master DB | 
	    |------------|     \---------/  
	    /     |      \
	   /      \/      \
|---------|  |---------| |---------|
|  Agent  |  |  Agent  | |  Agent  |
|---------|  |---------| |---------|
      |           |          |
    /----\     /----\      /----\
   |  DB  |   |  DB  |    |  DB  |
    \----/     \----/      \----/

</pre>

<p>
通常分为主控端(master)和多个代理节点(agency)，主控端和每个代理节点都有自己的存储空间(数据库)
</p>
</div>
</div>

<div id="outline-container-org4ac715e" class="outline-2">
<h2 id="org4ac715e"><span class="section-number-2">3</span> 各部分职责</h2>
<div class="outline-text-2" id="text-3">
<p>
主控端: 消息分发，执行重要的写操作
</p>

<p>
代理端: 向客户端提供数据，处理不重要的写操作，向主控端发送信息，将写操作提交给主控端处理
</p>
</div>
</div>

<div id="outline-container-orgaa83727" class="outline-2">
<h2 id="orgaa83727"><span class="section-number-2">4</span> 数据同步方式</h2>
<div class="outline-text-2" id="text-4">
<p>
数据在主控端和各个节点之间通常通过“声明与确认”的方式传输，主控端将数据库变更广播出去，各个节点自行从主控端获取数据并保存
</p>

<p>
也可由主控端直接发送数据原文，但这种方式有造成网络堵塞的风险，所以不推荐使用。
</p>
</div>
</div>

<div id="outline-container-org392fae8" class="outline-2">
<h2 id="org392fae8"><span class="section-number-2">5</span> 结论</h2>
<div class="outline-text-2" id="text-5">
<p>
CQRS是一种利用有限的资源和预算实现高负载系统的方式，且不会和组建集群一样需要大量的商业软件，定制的余地较大。
</p>


<p>
<a href="./index.html">回到首页</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2021-04-05 一 15:15</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
